; domain
(define (domain blocksword)
(:predicates
(sin_nada_encima ?x)
(encima_mesa ?x)
(brazo_libre)
(sujeto ?x)
(encima_bloque ?x ?y)
)
(:action coger
:parameters (?ob)
:precondition (and (sin_nada_encima ?ob)(encima_mesa ?ob)(brazo_libre))
:effect (and (sujeto ?ob) (not (sin_nada_encima ?ob)) (not (encima_mesa ?ob))(not
(brazo_libre)))
)
(:action soltar
:parameters (?ob)
:precondition (and (sujeto ?ob))
:effect (and (sin_nada_encima ?ob) (brazo_libre) (encima_mesa ?ob) (not (sujeto ?ob)))
)
(:action apilar
:parameters (?ob ?underob)
:precondition (and (sin_nada_encima ?underob)(sujeto ?ob))
:effect (and (sin_nada_encima ?ob) (brazo_libre) (encima_bloque ?ob ?underob) (not (sujeto
?ob))(not (sin_nada_encima ?underob)))
)
(:action desapilar
:parameters (?ob ?underob)
:precondition (and (encima_bloque ?ob ?underob) (sin_nada_encima ?ob) (brazo_libre))
:effect (and (sujeto ?ob) (sin_nada_encima ?underob) (not (encima_bloque ?ob ?underob)) (not
(sin_nada_encima ?ob)) (not (brazo_libre))))
)

; problem
(define (problem p02)
(:domain blocksword)
(:objects a b c d e)
(:init (brazo_libre) (encima_mesa e) (encima_bloque d e) (encima_bloque c d) (encima_bloque b c)
(encima_bloque a b) (sin_nada_encima a))
(:goal (and (brazo_libre) (encima_mesa a) (encima_bloque b a) (encima_bloque c b) (encima_bloque d c)
(encima_bloque e d) (sin_nada_encima e)))
)

; plan
1. (desapilar a b)
   deleted: (encima_bloque a b) (sin_nada_encima a) (brazo_libre)
   added: (sujeto a) (sin_nada_encima b)
   goals met: 0 of 7
2. (soltar a)
   deleted: (sujeto a)
   added: (sin_nada_encima a) (brazo_libre) (encima_mesa a)
   goals met: 2 of 7
3. (desapilar b c)
   deleted: (encima_bloque b c) (sin_nada_encima b) (brazo_libre)
   added: (sujeto b) (sin_nada_encima c)
   goals met: 1 of 7
4. (apilar b a)
   deleted: (sujeto b) (sin_nada_encima a)
   added: (sin_nada_encima b) (brazo_libre) (encima_bloque b a)
   goals met: 3 of 7
5. (desapilar c d)
   deleted: (encima_bloque c d) (sin_nada_encima c) (brazo_libre)
   added: (sujeto c) (sin_nada_encima d)
   goals met: 2 of 7
6. (apilar c b)
   deleted: (sujeto c) (sin_nada_encima b)
   added: (sin_nada_encima c) (brazo_libre) (encima_bloque c b)
   goals met: 4 of 7
7. (desapilar d e)
   deleted: (encima_bloque d e) (sin_nada_encima d) (brazo_libre)
   added: (sujeto d) (sin_nada_encima e)
   goals met: 4 of 7
8. (apilar d c)
   deleted: (sujeto d) (sin_nada_encima c)
   added: (sin_nada_encima d) (brazo_libre) (encima_bloque d c)
   goals met: 6 of 7
9. (coger e)
   deleted: (sin_nada_encima e) (encima_mesa e) (brazo_libre)
   added: (sujeto e)
   goals met: 4 of 7
10. (apilar e d)
   deleted: (sujeto e) (sin_nada_encima d)
   added: (sin_nada_encima e) (brazo_libre) (encima_bloque e d)
   goals met: 7 of 7
